In [ ]:
cd "/content/drive/MyDrive/Colab Notebooks/ANLY2500_01_Fall2025/LC/L26"

/content/drive/MyDrive/Colab Notebooks/ANLY2500_01_Fall2025/LC/L26

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
%pwd

'/content/drive/My Drive/Colab Notebooks/ANLY2500_01_Fall2025/LC/L26'

In [ ]:
%ls

L26_LCP.ipynb  sales.db

In [ ]:
%pip install jupysql duckdb duckdb-engine --quiet
# Load the SQL extension
%load_ext sql
# Setting: Show all rows
%config SqlMagic.displaylimit = None
# Connect to SQLite database
%sql sqlite:///sales.db


# Show tables
%sqlcmd tables


# Show columns in a table
%sqlcmd columns -t sale

   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 95.1/95.1 kB 2.8 MB/s eta 0:00:00
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 49.7/49.7 kB 2.6 MB/s eta 0:00:00
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 192.8/192.8 kB 7.5 MB/s eta 0:00:00
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 144.5/144.5 kB 8.1 MB/s eta 0:00:00

displaylimit: Value None will be treated as 0 (no limit)

Connecting to 'sqlite:///sales.db'

+------------------+---------+----------+---------+-------------+
|       name       |   type  | nullable | default | primary_key |
+------------------+---------+----------+---------+-------------+
|      RowNO       | INTEGER |   True   |   None  |      0      |
|     SaleDate     |   TEXT  |   True   |   None  |      0      |
|    CustomerID    | INTEGER |   True   |   None  |      0      |
|    FirstName     |   TEXT  |   True   |   None  |      0      |
|     LastName     |   TEXT  |   True   |   None  |      0      |
|     OrderID      | INTEGER |   True   |   None  |      0      |
|   ProductName    |   TEXT  |   True   |   None  |      0      |
|     Category     |   TEXT  |   True   |   None  |      0      |
|      Color       |   TEXT  |   True   |   None  |      0      |
|    SalePrice     |   REAL  |   True   |   None  |      0      |
|     Quantity     | INTEGER |   True   |   None  |      0      |
| ManufacturerName |   TEXT  |   True   |   None  |      0      |
+------------------+---------+----------+---------+-------------+

In [ ]:
%%sql
select *
from sale
limit 10
;

Running query in 'sqlite:///sales.db'

+-------+------------+------------+-----------+-----------+---------+-----------------------------------------+----------+--------------+-----------+----------+------------------+
| RowNO |  SaleDate  | CustomerID | FirstName |  LastName | OrderID |               ProductName               | Category |    Color     | SalePrice | Quantity | ManufacturerName |
+-------+------------+------------+-----------+-----------+---------+-----------------------------------------+----------+--------------+-----------+----------+------------------+
|   1   | 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |        be mini vulc wns sneakers        | sneakers |    Black     |   57.65   |    1     |       Puma       |
|   2   | 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |              liga sneakers              | sneakers |     Blue     |   63.05   |    1     |       Puma       |
|   3   | 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |     nike air max correlate sneakers     | sneakers |    Black     |    96.6   |    1     |       Nike       |
|   4   | 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |     timberland icon 6" premium boots    |  boots   |    Black     |   116.99  |    1     |    Timberland    |
|   5   | 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |        torry wedge tapestry wedge       |  wedges  | Green,Multi  |   15.29   |    2     |   Fashion Lab    |
|   6   | 12/31/2013 |   14958    |  Russell  |   Baker   |  191229 |  juno buckle animal trim wedge sneaker  |  boots   | Animal Print |   22.99   |    1     |  Apple Bottoms   |
|   7   | 12/31/2013 |    3275    |  Herschel |  Webster  |  191230 |          suede classic sneakers         | sneakers |    Purple    |    53.1   |    1     |       Puma       |
|   8   |  1/1/2014  |   17448    |  Margret  |  Gilmore  |  191231 | natalia high platform suede fringe boot |  boots   |    Black     |   50.04   |    2     |      Dereon      |
|   9   |  1/1/2014  |   11852    |    Ken    |   Carey   |  191232 |           nyc 83 vlc sneakers           | sneakers |    Black     |    72.0   |    1     |      Osiris      |
|   10  |  1/1/2014  |    5230    |    Toru   | Sakaguchi |  191233 |                 chehalis                | sneakers |    Black     |   16.48   |    1     |  Royal Elastics  |
+-------+------------+------------+-----------+-----------+---------+-----------------------------------------+----------+--------------+-----------+----------+------------------+

In [ ]:
%%sql
select sum(SalePrice*Quantity) as Amt,
       OrderID
from sale
group by OrderID
limit 10
;

Running query in 'sqlite:///sales.db'

+--------------------+---------+
|        Amt         | OrderID |
+--------------------+---------+
| 364.86999999999995 |  191228 |
|       22.99        |  191229 |
|        53.1        |  191230 |
|       100.08       |  191231 |
|        72.0        |  191232 |
|       16.48        |  191233 |
|       18.99        |  191234 |
|       333.86       |  191235 |
|        28.7        |  191236 |
|       40.24        |  191237 |
+--------------------+---------+

In [ ]:
# subtotal for each row
# sql: result in a single table
# select: columns
# from: result in a single table
# where: filtering (delete row), in a single table
# group by: divide a single table in multiple
#         : only way that will result in multiple tabs
# having: filtering multiples
# order by:
# max() min() count() sum() avg()
#     : work on a single table, result in a single row
%%sql
select SaleDate,
       CustomerID,
       FirstName, LastName,
       OrderID,
       ProductName,
       Category,
       Color,
       SalePrice*Quantity as Subtotal,
       ManufacturerName
from sale
limit 10
;

Running query in 'sqlite:///sales.db'

+------------+------------+-----------+-----------+---------+-----------------------------------------+----------+--------------+----------+------------------+
|  SaleDate  | CustomerID | FirstName |  LastName | OrderID |               ProductName               | Category |    Color     | Subtotal | ManufacturerName |
+------------+------------+-----------+-----------+---------+-----------------------------------------+----------+--------------+----------+------------------+
| 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |        be mini vulc wns sneakers        | sneakers |    Black     |  57.65   |       Puma       |
| 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |              liga sneakers              | sneakers |     Blue     |  63.05   |       Puma       |
| 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |     nike air max correlate sneakers     | sneakers |    Black     |   96.6   |       Nike       |
| 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |     timberland icon 6" premium boots    |  boots   |    Black     |  116.99  |    Timberland    |
| 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |        torry wedge tapestry wedge       |  wedges  | Green,Multi  |  30.58   |   Fashion Lab    |
| 12/31/2013 |   14958    |  Russell  |   Baker   |  191229 |  juno buckle animal trim wedge sneaker  |  boots   | Animal Print |  22.99   |  Apple Bottoms   |
| 12/31/2013 |    3275    |  Herschel |  Webster  |  191230 |          suede classic sneakers         | sneakers |    Purple    |   53.1   |       Puma       |
|  1/1/2014  |   17448    |  Margret  |  Gilmore  |  191231 | natalia high platform suede fringe boot |  boots   |    Black     |  100.08  |      Dereon      |
|  1/1/2014  |   11852    |    Ken    |   Carey   |  191232 |           nyc 83 vlc sneakers           | sneakers |    Black     |   72.0   |      Osiris      |
|  1/1/2014  |    5230    |    Toru   | Sakaguchi |  191233 |                 chehalis                | sneakers |    Black     |  16.48   |  Royal Elastics  |
+------------+------------+-----------+-----------+---------+-----------------------------------------+----------+--------------+----------+------------------+

In [ ]:
%%sql
select SaleDate,
       CustomerID,
       FirstName, LastName,
       OrderID,
       ProductName,
       Category,
       Color,
       SalePrice*Quantity as Subtotal,
       sum(SalePrice*Quantity) as Revenue,
       ManufacturerName
from sale
;

Running query in 'sqlite:///sales.db'

+------------+------------+-----------+----------+---------+---------------------------+----------+-------+----------+------------------+------------------+
|  SaleDate  | CustomerID | FirstName | LastName | OrderID |        ProductName        | Category | Color | Subtotal |     Revenue      | ManufacturerName |
+------------+------------+-----------+----------+---------+---------------------------+----------+-------+----------+------------------+------------------+
| 12/31/2013 |    1134    |  Xiafeng  |   Wang   |  191228 | be mini vulc wns sneakers | sneakers | Black |  57.65   | 777599.279999984 |       Puma       |
+------------+------------+-----------+----------+---------+---------------------------+----------+-------+----------+------------------+------------------+

In [ ]:
%%sql
select sum(SalePrice*Quantity) as Revenue,
       SaleDate
from sale
group by SaleDate
limit 10
;

Running query in 'sqlite:///sales.db'

+--------------------+-----------+
|      Revenue       |  SaleDate |
+--------------------+-----------+
| 188.55999999999997 |  1/1/2014 |
| 1451.8600000000004 |  1/1/2015 |
|       463.02       | 1/10/2014 |
| 1201.1000000000001 | 1/10/2015 |
| 1222.0000000000002 | 1/11/2014 |
|      1473.44       | 1/11/2015 |
|      1214.61       | 1/12/2014 |
|       130.05       | 1/12/2015 |
|      1484.97       | 1/13/2015 |
| 823.3000000000002  | 1/14/2014 |
+--------------------+-----------+

In [ ]:
%%sql
select sum(SalePrice*Quantity) as Revenue,
       CustomerID,
       FirstName,
       LastName
from sale
group by CustomerID
limit 10
;

Running query in 'sqlite:///sales.db'

+---------+------------+-----------+----------+
| Revenue | CustomerID | FirstName | LastName |
+---------+------------+-----------+----------+
|  348.07 |     12     |   James   | Dominick |
|  85.77  |     28     |    Hao    |   Lou    |
|  23.24  |     29     |  Ulysses  |  Reeves  |
|   65.0  |     30     |   Raquel  |  Lopez   |
|   21.1  |     34     |  Gilberto | Sterling |
|  120.9  |     42     |   Jeewon  |   Cho    |
|   56.4  |     47     |   Penny   |  Patton  |
|   76.8  |     96     |    Lila   |  Stein   |
|  394.75 |     98     |    Ryan   |  Cuevas  |
|  345.73 |    101     |    Karl   |   Lang   |
+---------+------------+-----------+----------+

In [ ]:
%%sql
select sum(SalePrice*Quantity) as Revenue,
       CustomerID,
       FirstName,
       LastName
from sale
group by CustomerID
order by Revenue desc
limit 10
;

Running query in 'sqlite:///sales.db'

+--------------------+------------+-----------+-----------+
|      Revenue       | CustomerID | FirstName |  LastName |
+--------------------+------------+-----------+-----------+
|       2393.0       |    5135    |   Magnus  |   Ramage  |
| 2135.7899999999995 |    1096    |   Meliha  |  Handzic  |
|      2008.75       |   13696    |    May    |  Vaughan  |
| 1805.8899999999996 |   13925    |  Gertrude |   Walls   |
| 1780.4199999999998 |   14396    |   Sally   |  Richmond |
| 1744.2400000000005 |    367     |    Andy   | Mcdonough |
|      1734.49       |   12393    | Elisabeth |  Townsend |
| 1683.7699999999998 |   13618    |   Linda   |   Levine  |
|      1640.95       |   18123    |   Carmen  |   Lewis   |
|      1582.55       |    3808    |  William  |   Lekse   |
+--------------------+------------+-----------+-----------+

In [ ]:
%%sql
select sum(SalePrice*Quantity) as Revenue,
       CustomerID,
       FirstName,
       LastName
from sale
group by CustomerID
having sum(SalePrice*Quantity)>2000
order by Revenue desc
limit 10
;

Running query in 'sqlite:///sales.db'

+--------------------+------------+-----------+----------+
|      Revenue       | CustomerID | FirstName | LastName |
+--------------------+------------+-----------+----------+
|       2393.0       |    5135    |   Magnus  |  Ramage  |
| 2135.7899999999995 |    1096    |   Meliha  | Handzic  |
|      2008.75       |   13696    |    May    | Vaughan  |
+--------------------+------------+-----------+----------+

In [ ]:
%%sql
select *
from sale
limit 10
;

Running query in 'sqlite:///sales.db'

+-------+------------+------------+-----------+-----------+---------+-----------------------------------------+----------+--------------+-----------+----------+------------------+
| RowNO |  SaleDate  | CustomerID | FirstName |  LastName | OrderID |               ProductName               | Category |    Color     | SalePrice | Quantity | ManufacturerName |
+-------+------------+------------+-----------+-----------+---------+-----------------------------------------+----------+--------------+-----------+----------+------------------+
|   1   | 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |        be mini vulc wns sneakers        | sneakers |    Black     |   57.65   |    1     |       Puma       |
|   2   | 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |              liga sneakers              | sneakers |     Blue     |   63.05   |    1     |       Puma       |
|   3   | 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |     nike air max correlate sneakers     | sneakers |    Black     |    96.6   |    1     |       Nike       |
|   4   | 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |     timberland icon 6" premium boots    |  boots   |    Black     |   116.99  |    1     |    Timberland    |
|   5   | 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |        torry wedge tapestry wedge       |  wedges  | Green,Multi  |   15.29   |    2     |   Fashion Lab    |
|   6   | 12/31/2013 |   14958    |  Russell  |   Baker   |  191229 |  juno buckle animal trim wedge sneaker  |  boots   | Animal Print |   22.99   |    1     |  Apple Bottoms   |
|   7   | 12/31/2013 |    3275    |  Herschel |  Webster  |  191230 |          suede classic sneakers         | sneakers |    Purple    |    53.1   |    1     |       Puma       |
|   8   |  1/1/2014  |   17448    |  Margret  |  Gilmore  |  191231 | natalia high platform suede fringe boot |  boots   |    Black     |   50.04   |    2     |      Dereon      |
|   9   |  1/1/2014  |   11852    |    Ken    |   Carey   |  191232 |           nyc 83 vlc sneakers           | sneakers |    Black     |    72.0   |    1     |      Osiris      |
|   10  |  1/1/2014  |    5230    |    Toru   | Sakaguchi |  191233 |                 chehalis                | sneakers |    Black     |   16.48   |    1     |  Royal Elastics  |
+-------+------------+------------+-----------+-----------+---------+-----------------------------------------+----------+--------------+-----------+----------+------------------+